{
  "backend/main.mo": "Motoko canister defining artworks, user profiles, purchases, and wallets with access control, artwork creation, profile management, and listing/query functions.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend components, hooks, utilities, and views.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and global UI theme for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling routing, authentication, profile setup, artwork dialogs, and gallery/upload view selection.",
  "frontend/src/components/AccessDenied.tsx": "Component showing a login-required message with navigation back to the gallery.",
  "frontend/src/components/AdminUploadForm.tsx": "Form supporting artwork creation and editing with image optimization, progress tracking, field validation, and correct mutation selection.",
  "frontend/src/components/AppHeaderNav.tsx": "Header navigation component with a single button for navigating to the gallery.",
  "frontend/src/components/ArtworkCard.tsx": "Displays an artwork thumbnail card with image, title, price, and optional SOLD badge or watermark, triggering onClick when selected.",
  "frontend/src/components/ArtworkDetailDialog.tsx": "Shows a detailed dialog for an artwork with large image, metadata, description, sold indicator, and optional edit button.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting the user to enter and save their name before continuing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on the user’s identity and updates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, authentication flow, and exposes identity context.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to determine whether the current authenticated user is an admin.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating artworks and user profiles via the backend actor.",
  "frontend/src/hooks/useRoute.ts": "Handles routing based on URL hash, supporting gallery and upload routes with optional edit parameters.",
  "frontend/src/hooks/useSoldDisplayPreference.ts": "Stores and updates the user's preference for displaying sold artworks as a badge or watermark.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme OKLCH color variables and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/utils/formatGBP.ts": "Formats a bigint penny amount into a GBP currency string.",
  "frontend/src/utils/imageOptimize.ts": "Optimizes images by resizing and compressing them within size and dimension limits.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/src/views/GalleryView.tsx": "Renders the gallery with sold filtering, display mode selection, and optional upload shortcut.",
  "frontend/src/views/UploadView.tsx": "Displays upload or edit artwork UI, loading artwork data when in edit mode.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins.",
  "project_state.json": "Captures project metadata, implemented features, and pending feature requests."
}