{
  "backend/main.mo": "Motoko canister implementing artwork storage, user profiles, access control, and artwork creation with authorization checks and blob storage integration.",
  "feature_evidence.json": "Feature evidence report describing removal of the Upload header button and listing affected frontend components and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend source files, including components, hooks, utilities, and routing behavior.",
  "frontend/index.css": "Tailwind base styles and CSS variable definitions for light and dark color palettes using OKLCH values.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, routing between gallery and upload views, profile setup gating, and UI layout.",
  "frontend/src/components/AccessDenied.tsx": "Component displaying a login-required message and a button to navigate back to the gallery.",
  "frontend/src/components/AdminUploadForm.tsx": "Artwork upload form with client-side validation, image optimization, and ExternalBlob upload progress tracking.",
  "frontend/src/components/AppHeaderNav.tsx": "Header navigation showing only the Gallery button after removal of the Upload button.",
  "frontend/src/components/ArtworkCard.tsx": "Clickable artwork card component showing a thumbnail, title, and formatted price using direct blob URLs.",
  "frontend/src/components/ArtworkDetailDialog.tsx": "Displays artwork details in a dialog with image, title, price, description, and creation date.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button wired to Internet Identity with loading and error handling states.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a modal for entering and saving a user's name during profile setup.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions using Internet Identity, exposing identity and login lifecycle.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries whether the current authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for artworks and user profiles, including list, fetch, create, and save operations.",
  "frontend/src/hooks/useRoute.ts": "Implements simple hash-based routing between gallery and upload views.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/formatGBP.ts": "Formats a bigint pence value into a GBP currency string.",
  "frontend/src/utils/imageOptimize.ts": "Loads, optionally resizes, and compresses images to meet size limits, returning optimized bytes and MIME type.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/src/views/GalleryView.tsx": "Renders the artwork gallery grid with loading and empty states, plus an optional upload shortcut card that navigates to the upload page.",
  "frontend/src/views/UploadView.tsx": "Displays a heading and embeds the AdminUploadForm for submitting new artwork.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, requirements, architectural notes, known issues, and feature versions for the Z'art gallery app."
}