{
  "backend/main.mo": "Main Motoko actor implementing an art marketplace with artwork CRUD operations, user profiles, ownership transfers, access control via mixins, and blob storage for images.",
  "feature_evidence.json": "Feature evidence report documenting a request to increase artwork card image dimensions in the Gallery page while maintaining list layout.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, views, and utilities for the art gallery application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using warm, gallery-appropriate tones.",
  "frontend/index.html": "HTML entry point for the Z'art application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component managing authentication, routing between gallery and upload views, artwork detail dialog, profile setup flow, and sold display preferences with background texture.",
  "frontend/src/components/AccessDenied.tsx": "Component displaying a login-required message with shield icon and button to return to gallery when unauthenticated users try to access restricted pages.",
  "frontend/src/components/AdminUploadForm.tsx": "Form component supporting create and edit modes for artworks with image upload/replacement, client-side optimization, progress tracking, prefilled fields in edit mode, and delete functionality.",
  "frontend/src/components/AppHeaderNav.tsx": "Navigation component with a Gallery button that highlights the active route.",
  "frontend/src/components/ArtworkCard.tsx": "Card component displaying artwork with enlarged image (h-80), title below, and sold status shown as either badge or diagonal watermark based on display mode preference.",
  "frontend/src/components/ArtworkDetailDialog.tsx": "Dialog component displaying full artwork details with image, metadata, and optional sold status toggle. Implements optimistic UI updates for sold status changes with error handling.",
  "frontend/src/components/LoginButton.tsx": "Button component for Internet Identity authentication that handles login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for initial user profile setup that prompts for and validates a user's name before allowing app access.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance based on authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "Hook that queries the backend to determine if the current authenticated user has admin privileges.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on artworks and user profiles, including listing, creating, updating, deleting artworks and managing sold status.",
  "frontend/src/hooks/useRoute.ts": "Custom routing hook using URL hash to manage navigation between gallery and upload routes with support for edit mode parameters.",
  "frontend/src/hooks/useSoldDisplayPreference.ts": "Hook managing user preference for sold artwork display mode (badge or watermark) with localStorage persistence.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette for light and dark themes using warm gallery-inspired colors and CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider context before rendering the main App component.",
  "frontend/src/utils/formatGBP.ts": "Utility function that converts pence (bigint) to formatted GBP currency string using Intl.NumberFormat.",
  "frontend/src/utils/imageOptimize.ts": "Provides image optimization functionality that resizes images to max 2048px dimension and compresses to JPEG at 85% quality if they exceed 2MB file size, using canvas-based resizing with high-quality smoothing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for maintaining state across navigation.",
  "frontend/src/views/GalleryView.tsx": "Gallery view component that displays a filterable grid of artwork cards with controls for showing/hiding sold items and selecting sold display mode (badge or watermark), plus an optional upload shortcut button for authenticated users.",
  "frontend/src/views/UploadView.tsx": "Upload/edit view component that renders an AdminUploadForm, supporting both new artwork creation and editing existing artworks by ID with loading and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter and Playfair Display), container queries, typography plugin, and custom animations for accordions.",
  "project_state.json": "Project state metadata tracking an art gallery application with a recent feature to enlarge gallery images while maintaining list layout with titles below images within cards."
}