{
  "backend/main.mo": "Motoko canister managing artworks, user profiles, wallets, and purchases with admin‑gated artwork creation and profile authorization logic.",
  "feature_evidence.json": "Metadata describing feature evidence, listing related frontend files, components, and test IDs for two navigation and UI‑split features.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose, behavior, and roles in the app.",
  "frontend/index.css": "Tailwind base/theme configuration defining warm OKLCH color tokens, dark mode variants, and global styles.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx with a root mount element.",
  "frontend/src/App.tsx": "Main React component handling authentication, admin checks, routing, profile setup, and rendering gallery or upload views.",
  "frontend/src/components/AccessDenied.tsx": "UI card shown when a non‑admin attempts to access the upload page, with a button navigating back to the gallery.",
  "frontend/src/components/AdminUploadForm.tsx": "Admin‑only artwork upload form with image optimization, progress tracking, input validation, and backend submission.",
  "frontend/src/components/AppHeaderNav.tsx": "Header navigation that shows Gallery and conditionally the Upload button for authenticated admins using hash‑based routing.",
  "frontend/src/components/ArtworkCard.tsx": "Clickable artwork card displaying a thumbnail, title, and formatted price using the image’s direct URL.",
  "frontend/src/components/ArtworkDetailDialog.tsx": "Displays a dialog with artwork details, including image, title, price, description, and creation date.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting the user to enter and save their name during profile setup.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity context.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to determine whether the current authenticated user is an admin.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating artworks and user profile data through the actor.",
  "frontend/src/hooks/useRoute.ts": "Tracks and updates the current app route based on the URL hash.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and renders the root component.",
  "frontend/src/utils/formatGBP.ts": "Formats a bigint value in pence into a GBP currency string.",
  "frontend/src/utils/imageOptimize.ts": "Resizes and compresses images client-side to meet size limits, returning optimized bytes and MIME type.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/src/views/GalleryView.tsx": "Renders the artwork gallery with loading state, empty-state messaging, and clickable artwork cards.",
  "frontend/src/views/UploadView.tsx": "Displays the admin artwork upload page with a heading and the AdminUploadForm component.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project state, feature set, and architectural notes for the Z'art artwork gallery application."
}