{
  "backend/main.mo": "Motoko canister managing artworks, user profiles, image storage, and authorization with CRUD operations and ownership/admin checks.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend components and hooks for routing, artwork management, UI, and permissions.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme variables and global layout settings.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring routing, authentication, artwork fetching, profile setup, and artwork detail dialog state.",
  "frontend/src/components/AccessDenied.tsx": "Card UI informing unauthenticated users they must log in to upload and linking back to gallery.",
  "frontend/src/components/AdminUploadForm.tsx": "Form for creating/editing artworks with image optimization, upload progress, and delete action in edit mode.",
  "frontend/src/components/AppHeaderNav.tsx": "Header navigation with a single Gallery button using hash‑based routing.",
  "frontend/src/components/ArtworkCard.tsx": "Artwork card showing thumbnail, title, price, and optional sold badge or watermark.",
  "frontend/src/components/ArtworkDetailDialog.tsx": "Displays a dialog with artwork details, image, edit and close controls, and supports optimistic sold-status toggling.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity and handles auth state and retry logic.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a modal for entering and saving a user's name during initial profile setup.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, and stored identity handling.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to determine whether the authenticated caller is an admin, tied to the actor and identity state.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for CRUD operations on artworks, including fetching, creating, updating, deleting, and toggling sold status.",
  "frontend/src/hooks/useRoute.ts": "Manages routing via the URL hash, supporting gallery and upload views with optional edit parameters.",
  "frontend/src/hooks/useSoldDisplayPreference.ts": "Stores and retrieves the user's preferred sold-display mode (badge or watermark) using localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/formatGBP.ts": "Formats a bigint representing pence into a GBP currency string.",
  "frontend/src/utils/imageOptimize.ts": "Resizes and recompresses images exceeding size or dimension limits, returning optimized JPEG bytes and mime type.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL/hash.",
  "frontend/src/views/GalleryView.tsx": "Renders the artwork gallery with filtering for sold pieces and UI controls including optional upload shortcut.",
  "frontend/src/views/UploadView.tsx": "Displays upload or edit form for an artwork, loading existing data when in edit mode.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing requirements to remove all delete actions from the gallery and keep deletion only on the edit page."
}