{
  "backend/main.mo": "Main Motoko actor implementing an art marketplace with artwork CRUD operations, user profiles, role-based access control (admin/user permissions), ownership validation, and blob storage integration for images.",
  "feature_evidence.json": "Feature evidence report documenting that the Upload Artwork button size reduction was implemented in AdminUploadForm.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including routing, authentication, artwork management, UI components, and styling configuration; notes that AdminUploadForm now has reduced upload control size with smaller padding, icon, text, gap, and constrained width.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color tokens for light and dark themes with warm, gallery-appropriate palette avoiding blue/purple tones.",
  "frontend/index.html": "HTML entry point for the Z'art application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication, routing between gallery/upload views, artwork selection dialog, profile setup flow, sold display preferences, and edit artwork navigation with automatic state synchronization.",
  "frontend/src/components/AccessDenied.tsx": "Component displaying a login-required message with shield icon and return-to-gallery button when unauthenticated users attempt to access protected routes.",
  "frontend/src/components/AdminUploadForm.tsx": "Form component for creating and editing artworks with image upload/preview, client-side optimization, progress tracking, field validation, and delete button in edit mode; upload control has reduced size with smaller padding (p-4), icon (h-8 w-8), text (text-xs), gap (gap-1.5), and constrained width (max-w-xs mx-auto).",
  "frontend/src/components/AppHeaderNav.tsx": "Navigation component with a Gallery button that highlights the active route and triggers navigation.",
  "frontend/src/components/ArtworkCard.tsx": "Reusable card component displaying artwork thumbnail, title, and price with hover effects, supporting both badge and diagonal watermark display modes for sold artworks.",
  "frontend/src/components/ArtworkDetailDialog.tsx": "Dialog component displaying full artwork details with image, metadata, and optional sold status toggle with optimistic UI updates. Includes edit button and supports badge/watermark display modes for sold items.",
  "frontend/src/components/LoginButton.tsx": "Button component for Internet Identity authentication that handles login/logout with loading states and error recovery. Clears query cache on logout.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for initial user profile setup that prompts for name entry. Non-dismissible until name is provided.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Includes status tracking and error handling.",
  "frontend/src/hooks/useIsAdmin.ts": "Hook that queries the backend to check if the current authenticated user has admin privileges. Depends on actor and identity availability.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on artworks and user profiles, including listing, creating, updating, deleting, and toggling sold status. Handles cache invalidation and refetching.",
  "frontend/src/hooks/useRoute.ts": "Custom routing hook using URL hash for navigation between gallery and upload views. Supports route parameters like edit mode for artworks.",
  "frontend/src/hooks/useSoldDisplayPreference.ts": "Hook managing user preference for sold artwork display mode (badge or watermark) with localStorage persistence.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using a warm gallery color palette. Includes chart colors and typography utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/formatGBP.ts": "Utility function converting pence (bigint) to formatted GBP currency string using Intl.NumberFormat.",
  "frontend/src/utils/imageOptimize.ts": "Provides an optimizeImage function that resizes images to a maximum dimension of 2048px and compresses them to JPEG at 85% quality if they exceed 2MB or dimension limits.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage support for maintaining state across navigation.",
  "frontend/src/views/GalleryView.tsx": "Renders the gallery view with artwork cards, a toggle to show/hide sold items, a sold display mode selector (badge/watermark), and an optional upload shortcut card for authenticated users.",
  "frontend/src/views/UploadView.tsx": "Renders the upload/edit artwork page, displaying AdminUploadForm with optional artwork data for editing; shows loading state or error message when editing a non-existent artwork.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter, Playfair Display), container queries, typography plugin, and animation utilities.",
  "project_state.json": "Project state tracking multiple pending feature requests to remove all delete artwork controls from the gallery/list view and ensure deletion is only available via the AdminUploadForm edit page."
}